In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\hp\miniconda3\envs\cv_collection_review_rnd\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.22.4 in c:\users\hp\miniconda3\envs\cv_collection_review_rnd\lib\site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\miniconda3\envs\cv_collection_review_rnd\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\miniconda3\envs\cv_collection_review_rnd\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\hp\miniconda3\envs\cv_collection_review_rnd\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\hp\miniconda3\envs\cv_collection_review_rnd\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [ ]:
import pandas as pd

### Series

In [3]:
data = [10, 20, 30, 40, 50]
s1 = pd.Series(data)
print (s1)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
import numpy as np

data = np.array([10, 20, 30, 40, 50])
s2 = pd.Series(data)
print (s2)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
data = {"a": 10, "b": 20, "c": 30, "d": 40, "e": 50}
s3 = pd.Series(data)
print (s3)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [8]:
data = [10, 20, 30, 40, 50]
s4 = pd.Series(data, index=["a", "b", "c", "d", "e"], name="score")
print (s4)

a    10
b    20
c    30
d    40
e    50
Name: score, dtype: int64

In [13]:
print (s4.name)
print (s4.index)
print (s4.values)
print (s4.dtypes)

score
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
[10 20 30 40 50]
int64

Indexing and Slicing

In [14]:
data = [10, 20, 30, 40, 50]
s4 = pd.Series(data, index=["a", "b", "c", "d", "e"], name="score")
print (s4)

a    10
b    20
c    30
d    40
e    50
Name: score, dtype: int64

In [15]:
s4[0]

C:\Users\HP\AppData\Local\Temp\ipykernel_71624\957271931.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s4[0]

np.int64(10)

In [27]:
s4.iloc[0] # Positional Indexing

np.int64(10)

In [28]:
s4.loc["a"] # Indexing

np.int64(10)

In [20]:
s4.iloc[0:2]

a    10
b    20
Name: score, dtype: int64

In [26]:
data = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
s5 = pd.Series(data, index=["a", "b", "c", 0, 1, 2, 3, "x", "y", "z"], name="score")
print (s5.loc[0:2])

0    40
1    50
2    60
Name: score, dtype: int64

In [32]:
# Slicing:
# - loc [start, end] ---> end is inclusive
# - iloc [start, end] ---> end is exclusive

### Dataframe

In [35]:
data1 = [
    {"Name": "Sooriya", "Age": 20, "City": "Toronto"},
    {"Name": "Kumar", "Age": 30, "City": "New York"},
    {"Name": "Soori Kum", "Age": 40, "City": "New Jersey"},
]

df1 = pd.DataFrame(data1)

print (df1)

        Name  Age        City
0    Sooriya   20     Toronto
1      Kumar   30    New York
2  Soori Kum   40  New Jersey

In [39]:
data2 = np.array([[1, 2], [3, 4], [5, 6]])
df2 = pd.DataFrame(data2)
print (df2)

   0  1
0  1  2
1  3  4
2  5  6

In [41]:
data3 = {
    "Name": ["Sooriya", "Kumar", "Soori Kum"],
    "Age": [10, 20, 30],
    "City": ["Toronto", "New York", "New Jersey"]
}

df3 = pd.DataFrame(data3)

print (df3)

        Name  Age        City
0    Sooriya   10     Toronto
1      Kumar   20    New York
2  Soori Kum   30  New Jersey

In [43]:
type(df3)

pandas.core.frame.DataFrame

Accessing Values

In [53]:
print (df3["Name"])
print ("="*40)
print (df3[["Name", "Age"]])
print ("="*40)
print (df3.iloc[0])
print ("="*40)
print (df3.iloc[0:2])
print ("="*40)
print (df3.loc[0])
print ("="*40)
print (df3.loc[0:2])

0      Sooriya
1        Kumar
2    Soori Kum
Name: Name, dtype: object
========================================
        Name  Age
0    Sooriya   10
1      Kumar   20
2  Soori Kum   30
========================================
Name    Sooriya
Age          10
City    Toronto
Name: 0, dtype: object
========================================
      Name  Age      City
0  Sooriya   10   Toronto
1    Kumar   20  New York
========================================
Name    Sooriya
Age          10
City    Toronto
Name: 0, dtype: object
========================================
        Name  Age        City
0    Sooriya   10     Toronto
1      Kumar   20    New York
2  Soori Kum   30  New Jersey

In [46]:
type(df3["Name"])

pandas.core.series.Series

Working with real dataset

In [54]:
# https://github.com/datasciencedojo/datasets
# https://github.com/mwaskom/seaborn-data/tree/master
# https://raw.githubusercontent.com/datasciencedojo/datasets/refs/heads/master/titanic.csv

In [55]:
titanic_csv_url = "https://raw.githubusercontent.com/datasciencedojo/datasets/refs/heads/master/titanic.csv"

df = pd.read_csv(titanic_csv_url)

In [56]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [57]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [58]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [59]:
print (df.tail())

     PassengerId  Survived  Pclass                                      Name  \
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch      Ticket   Fare Cabin Embarked
886    male  27.0      0      0      211536  13.00   NaN        S
887  female  19.0      0      0      112053  30.00   B42        S
888  female   NaN      1      2  W./C. 6607  23.45   NaN        S
889    male  26.0      0      0      111369  30.00  C148        C
890    male  32.0      0      0      370376   7.75   NaN        Q

In [60]:
df["Name"]

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [62]:
df[["Name", "Ticket"]]

                                                  Name            Ticket
0                              Braund, Mr. Owen Harris         A/5 21171
1    Cumings, Mrs. John Bradley (Florence Briggs Th...          PC 17599
2                               Heikkinen, Miss. Laina  STON/O2. 3101282
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)            113803
4                             Allen, Mr. William Henry            373450
..                                                 ...               ...
886                              Montvila, Rev. Juozas            211536
887                       Graham, Miss. Margaret Edith            112053
888           Johnston, Miss. Catherine Helen "Carrie"        W./C. 6607
889                              Behr, Mr. Karl Howell            111369
890                                Dooley, Mr. Patrick            370376

[891 rows x 2 columns]

In [63]:
df.loc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [64]:
df.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [65]:
df.loc[0:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [66]:
df.iloc[0:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [67]:
df.loc[0, "Name"]

'Braund, Mr. Owen Harris'

In [68]:
df.iloc[0, 3]

'Braund, Mr. Owen Harris'

Conditional Selection

In [74]:
# df[condition]

df[df["Age"] >= 71]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [81]:
df[df["Age"] < 18]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
850,851,0,3,"Andersson, Master. Sigvard Harald Elias",male,4.0,4,2,347082,31.2750,NaN,S
852,853,0,3,"Boulos, Miss. Nourelain",female,9.0,1,1,2678,15.2458,NaN,C
853,854,1,1,"Lines, Miss. Mary Conover",female,16.0,0,1,PC 17592,39.4000,D28,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C

In [87]:
women = df[(df["Age"] > 50) & (df["Sex"] == "female")][["Name", "Age"]]

women.head(7)

                                                 Name   Age
11                           Bonnell, Miss. Elizabeth  58.0
15                   Hewlett, Mrs. (Mary D Kingcome)   55.0
195                              Lurette, Miss. Elise  58.0
268     Graham, Mrs. William Thompson (Edith Junkins)  58.0
275                 Andrews, Miss. Kornelia Theodosia  63.0
366  Warren, Mrs. Frank Manley (Anna Sophia Atkinson)  60.0
483                            Turkula, Mrs. (Hedwig)  63.0

In [92]:
survived = len(df[df["Survived"] == 1])
not_survived = len(df[df["Survived"] == 0])

print (f"Total People = {survived + not_survived}")
print (f"Survived People = {survived * 100 / (survived + not_survived)} %")
print (f"Not Survived People = {not_survived * 100 / (survived + not_survived)} %")

Total People = 891
Survived People = 38.38383838383838 %
Not Survived People = 61.61616161616162 %